laminar_elongated_sphere_final/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.000520333 0 0);
boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
	{
		type  freestream;
		freestreamValue $internalField;
	}


    outlet
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    topandbottom
    {
        type            fixedValue;
        value           $internalField;
    }

    sphere
    {
        type            noSlip;
    }

    frontandback
    {
    	type		 empty;
    }
}


// ************************************************************************* //
