laminar_elongated_sphere_final/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0.01138;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            freestream;
        freestreamValue uniform 0.01138;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 0.01138;
    }

    topandbottom
    {
        type            freestream;
        freestreamValue uniform 0.01138;
    }

    frontandback
    {
    	type		empty;
    }

    sphere
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
